In [1]:
import numpy as np
import pandas as pd

In [2]:
d1={
    'City':['Del','Jpur','Lnow','Simla'],
    'Temp':[35,38,34,25]
}

In [3]:
d2={
    'City':['Hyd','Blr','Che','Vizag'],
    'Temp':[35,32,38,36]
}

In [4]:
d3={
    'City':['A','B','C','D'],
    'Temp':[35,38,34,25]
}

In [5]:
d4={
    'City':['X','Y','Z','W'],
    'Temp':[35,38,34,25]
}

In [6]:
dfnorth=pd.DataFrame(d1)

In [7]:
dfnorth

    City  Temp
0    Del    35
1   Jpur    38
2   Lnow    34
3  Simla    25

In [8]:
dfsouth=pd.DataFrame(d2)

In [9]:
dfsouth

    City  Temp
0    Hyd    35
1    Blr    32
2    Che    38
3  Vizag    36

In [12]:
dfcity=pd.concat([dfnorth,dfsouth])

In [13]:
dfcity

    City  Temp
0    Del    35
1   Jpur    38
2   Lnow    34
3  Simla    25
0    Hyd    35
1    Blr    32
2    Che    38
3  Vizag    36

In [14]:
dfcity.loc[2]

   City  Temp
2  Lnow    34
2   Che    38

In [15]:
dfcity.iloc[5]

City    Blr
Temp     32
Name: 1, dtype: object

In [16]:
dfcity

    City  Temp
0    Del    35
1   Jpur    38
2   Lnow    34
3  Simla    25
0    Hyd    35
1    Blr    32
2    Che    38
3  Vizag    36

In [17]:
dfindia=pd.concat([dfnorth,dfsouth],ignore_index=True)

In [18]:
dfindia

    City  Temp
0    Del    35
1   Jpur    38
2   Lnow    34
3  Simla    25
4    Hyd    35
5    Blr    32
6    Che    38
7  Vizag    36

In [19]:
dfcity

    City  Temp
0    Del    35
1   Jpur    38
2   Lnow    34
3  Simla    25
0    Hyd    35
1    Blr    32
2    Che    38
3  Vizag    36

In [22]:
dfcity=dfcity.reset_index()

In [23]:
dfcity.drop('index',axis=1)

    City  Temp
0    Del    35
1   Jpur    38
2   Lnow    34
3  Simla    25
4    Hyd    35
5    Blr    32
6    Che    38
7  Vizag    36

In [24]:
df2=pd.concat([dfnorth,dfsouth],keys=['North','South'])

In [25]:
df2

          City  Temp
North 0    Del    35
      1   Jpur    38
      2   Lnow    34
      3  Simla    25
South 0    Hyd    35
      1    Blr    32
      2    Che    38
      3  Vizag    36

In [42]:
ds1={
    'City':['Del','Jpur','Lnow','Simla'],
    'Temp':[35,38,34,25]
}

In [43]:
ds2={
    'City':['Del','Jpur','Lnow','Simla'],
    'Humid':[35,32,38,36]
}

In [44]:
dftemp=pd.DataFrame(ds1)

In [45]:
dfhumid=pd.DataFrame(ds2)

In [46]:
dftemp

    City  Temp
0    Del    35
1   Jpur    38
2   Lnow    34
3  Simla    25

In [47]:
dfhumid

    City  Humid
0    Del     35
1   Jpur     32
2   Lnow     38
3  Simla     36

In [48]:
pd.concat([dftemp,dfhumid],axis=1)

    City  Temp   City  Humid
0    Del    35    Del     35
1   Jpur    38   Jpur     32
2   Lnow    34   Lnow     38
3  Simla    25  Simla     36

In [49]:
dftemp=dftemp.set_index('City')

In [50]:
dfhumid=dfhumid.set_index('City')

In [51]:
dftemp

       Temp
City
Del      35
Jpur     38
Lnow     34
Simla    25

In [52]:
dfhumid

       Humid
City
Del       35
Jpur      32
Lnow      38
Simla     36

In [53]:
dfc=pd.concat([dftemp,dfhumid],axis=1)

In [39]:
dfc

       Temp  Humid
City
Del      35     35
Jpur     38     32
Lnow     34     38
Simla    25     36

In [54]:
dfc=dfc.reset_index('City')

In [55]:
dfc

    City  Temp  Humid
0    Del    35     35
1   Jpur    38     32
2   Lnow    34     38
3  Simla    25     36